MorseCode = {}
MorseCode_ru = {"А": "·−", "Б": "−···", "В": "·−−", "Г": "−−·", "Д": "−··", "Е": "·", "Ж": "···−",
                "З": "−−··", "И": "··", "Й": "·−−−", "К": "−·−", "Л": "·−··", "М": "−−", "Н": "−·",
                "О": "−−−", "П": "·−−·", "Р": "·−·", "С": "···", "Т": "−", "У": "··−", "Ф": "··−·",
                "Х": "····", "Ц": "−·−·", "Ч": "−−−·", "Ш": "−−−−", "Щ": "−−·−", "Ъ": "−−·−−",
                "Ы": "−·−−", "Ь": "−··−", "Э": "··−··", "Ю": "··−−", "Я": "·−·−",

                "1": "·−−−−", "2": "··−−−", "3": "···−−", "4": "····−", "5": "·····", "6": "−····",
                "7": "−−···", "8": "−−−··", "9": "−−−−·", "0": "−−−−−", ".": "······", ",": "·−·−·−",
                ":": "−−−···", ";": "−·−·−·", "(": "−·−−·−", ")": "−·−−·−", "'": "·−−−−·",
                '"': "·−··−·", "-": "−····−", "/": "−··−·", "_": "··−−·−", "?": "··−−··",
                "!": "−−··−−", " + ": "·−·−·"}
# словарь для перевода на русский

MorseCode_en = {"A": "·−", "B": "−···", "W": "·−−", "G": "−−·", "D": "−··", "E": "·", "V": "···−",
                "Z": "−−··", "I": "··", "J": "·−−−", "K": "−·−", "L": "·−··", "M": "−−", "N": "−·",
                "O": "−−−", "P": "·−−·", "R": "·−·", "S": "···", "T": "−", "U": "··−", "F": "··−·",
                "H": "····", "C": "−·−·", "Q": "−−·−", "Y": "−·−−", "X": "−··−",

                "1": "·−−−−", "2": "··−−−", "3": "···−−", "4": "····−", "5": "·····", "6": "−····",
                "7": "−−···", "8": "−−−··", "9": "−−−−·", "0": "−−−−−", ".": "······", ",": "·−·−·−",
                ":": "−−−···", ";": "−·−·−·", "(": "−·−−·−", ")": "−·−−·−", "'": "·−−−−·",
                '"': "·−··−·", "-": "−····−", "/": "−··−·", "_": "··−−·−", "?": "··−−··",
                "!": "−−··−−", " + ": "·−·−·"}
# словарь для перевода на английский


def lang():  # функция для выбора языка
    a = None
    global MorseCode
    print()
    while a != 1 or a != 2:
        print("Выбирите язык")
        print("1 - Русский"
              "\n2 - Английский")
        a = int(input())
        if a == 1:
            MorseCode = MorseCode_ru
            break
        elif a == 2:
            MorseCode = MorseCode_en
            break


def encode_to_morse(text):  # Кодирование в код Морзе
    word = []  # переменная для составления из букв слова
    sentence = []  # переменная для составления из слов предложений
    if text != "":  # условие для завершения программы
        x = text.upper().split(" ")  # приводит к общему виду и создает список слов
        for i in x:
            for j in i:
                y = MorseCode.get(j)  # преобразует каждую бкуву в код морзе
                word.append(y)  # добавляет буквы и создает слово
            sentence.append(" ".join(word))  # склеивает слова в предложение
            word.clear()
        print("[" + str(text) + "]")
        print("  ".join(sentence))  # превращает список в строчку
        print()
        print("Нажмите ENTER чтобы выйти")
    else:
        print("Отключение от сервера...")


def decode_from_morse(code):  # Декодирование кода Морзе
    word = []
    sentence = []
    if code != "":
        x = code.split("  ")  # делит строку на слова
        for i in x:
            y = i.split(" ")  # делит слова на буквы
            for j in y:
                for k, v in MorseCode.items():  # преобразует каждую бкуву из кода морзе в норм.букву
                    if v == j:
                        word.append(k)
            sentence.append("".join(word))
            word.clear()
        print("[" + str(code) + "]")
        print(" ".join(sentence))
        print()
        print("Нажмите ENTER чтобы выйти")
    else:
        print("Отключение от сервера...")


def main():  # функция запуска программы
    x, text, code = None, None, None
    print("Запустить программу ?\n1 - Да\n0 - Нет")
    s = input()
    if s == "Да" or s == "да" or s == "1":
        lang()
        while x != 1 or x != 2 or x != 3 or x != 0:
            print("\n1 - Кодирование в код Морзе"
                  "\n2 - Декодирование кода Морзе"
                  "\n3 - Выбор языка"
                  "\n0 - Выйти")
            x = int(input())
            if x == 1:
                print("Кодирование в код Морзе")
                print()
                while text != "":
                    text = input("Ввод: ")
                    encode_to_morse(text)  # Кодирование в код Морзе
                    print()
                text = None
            elif x == 2:
                print("Декодирование кода Морзе")
                print()
                while code != "":
                    code = input("Ввод: ")
                    decode_from_morse(code)  # Декодирование кода Морзе
                    print()
                code = None
            elif x == 3:
                lang()
            elif x == 0:
                print()
                print("Отключение от сервера...")
                break
            else:
                print("Повторите ввод...")
                continue
    elif s == "Нет" or s == "нет" or s == "0":
        print("Отключение от окружения...")
    else:
        print("...")
