def number_to_words(n):
    n1 = {1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять",
          6: "шесть", 7: "семь", 8: "восемь", 9: "девять", 10: "десять"}
    n2 = {11: "одиннадцать", 12: "двенадцать", 13: "тринадцать",
          14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать",
          17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать"}
    n3 = {20: "двадцать", 30: "тридцать", 40: "сорок",
          50: "пятьдесят", 60: "шестьдесят", 70: "семьдесят",
          80: "восемьдесят", 90: "девяносто"}
    x = n % 10
    y = n - x
    if n <= 10:
        return n1.get(n)
    elif 10 < n <= 19:
        return n2.get(n)
    elif n >= 20:
        if x == 0:
            return n3.get(n)
        else:
            return str(n3.get(y)) + ' ' + str(n1.get(x))
